Tekla Open API Reference for Tekla Structures 2025
ControlObjectLineType Enumeration
 The line types (the presentation of the line).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ControlObjectLineType
Public Enumeration ControlObjectLineType
Members
Member name | Value | Description
SolidLine | 1 |  The solid line (default).
DashedLine | 2 |  The dashed line (-----).
SlashedLine | 3 |  The slashed line (- - -).
DashDot | 4 |  The dash dotted line (--.--.).
DottedLine | 5 |  The dotted line (.....).
See Also
Reference
Tekla.Structures.Model Namespace